---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaces
source: html/303bce4e-3c69-58f3-18ef-281449324825.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaces Property

Revit was unable to identify any spaces. If you are sure that spaces have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which spaces have been defined in your project.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSpaces { get; }
```